# SQL - (Structured Query Language) 
It is the language that we use when we try to interact with the database or we can say that SQL is basically a standard that all relational DBMS like Mysql implement.

Mysql

we will be using mysql throughout these tutorial but the concepts that we will learn can be applied to pretty much any relational databases.

# Working with Databases
in order to start working with databases, we first need to create them and then select them to use that databases, after that we can make table in those databases to store the various data in tabular format as per our requirement.
- to create a database we use - 
**CREATE DATABASE mydb**(we have already created a database)
<p>once the database is created , we can select that databases, by doing this we explicitly tell mysql that out of all the available databases which one of them we want to work upon.</p>
- to select a database
**"USE mydb"**

# Why SQL is so important?
[Why SQL is in demand](https://www.freecodecamp.org/news/why-learn-sql/)

---
[Why you Should Learn SQL](https://www.youtube.com/watch?v=wr7Qwp0cBzI)

### **RUN NEXT 5 CELLS TO CREATE DATABASE, TABLE AND TO INSERT DATA**

In [5]:
## JUST RUN THIS CELL
import sqlite3
import pandas as pd

df = pd.DataFrame({"id": [1, 2, 3, 4, 5],
    "name": ["David Beggam", "Rahul Josh",
                            "Joe Kamal", "Micheal John", "Sarath Kumar"],
                  "address": ["California", "Mumbai",
                              "Banglore", "Delhi", "Chennai"]})

df.set_index("id", inplace=True)

In [6]:
# Run this and look at your dataframe which you will pass into database
df.head()

            name     address
id
1   David Beggam  California
2     Rahul Josh      Mumbai
3      Joe Kamal    Banglore
4   Micheal John       Delhi
5   Sarath Kumar     Chennai

In [7]:
# run this to create and connect to database
connection = sqlite3.connect('cloud.db')
df.to_sql('customers', connection)

5

In [8]:
# load sql extension
%load_ext sql

In [13]:
# connecting to cloud.db
%sql sqlite:///cloud.db

## Hoorayy!!Now it's time to check your skill on sql . Write a code for below questions

##### **NOTE** : Do not remove %%sql magic command as it will throw error if you run sql query without it.

### 1.Show all the data inside the table"customers"

In [17]:
%%sql
select * from customers

 * sqlite:///cloud.db
Done.

[(1, 'David Beggam', 'California'),
 (2, 'Rahul Josh', 'Mumbai'),
 (3, 'Joe Kamal', 'Banglore'),
 (4, 'Micheal John', 'Delhi'),
 (5, 'Sarath Kumar', 'Chennai')]

### **Check This link to See How to Limit Customer Data**

https://www.w3schools.com/sql/sql_top.asp

<b>##2. LIMIT CUSTOMERS DATA TO 3</b>

In [18]:
%%sql
select * from customers limit 3

 * sqlite:///cloud.db
Done.

[(1, 'David Beggam', 'California'),
 (2, 'Rahul Josh', 'Mumbai'),
 (3, 'Joe Kamal', 'Banglore')]

<b>3.Select all the data of employees that work in Chennai and Mumbai </b>

In [21]:
%%sql
select * from customers where address = 'Mumbai' or address = 'Chennai'

 * sqlite:///cloud.db
Done.

[(2, 'Rahul Josh', 'Mumbai'), (5, 'Sarath Kumar', 'Chennai')]

<b>4. select name starting with letter S</b>

In [22]:
%%sql

select * from customers where name like 'S%'

 * sqlite:///cloud.db
Done.

[(5, 'Sarath Kumar', 'Chennai')]

<b>##5. select the col"address" from the table"customers" </b>

In [23]:
%%sql
select address from customers

 * sqlite:///cloud.db
Done.

[('California',), ('Mumbai',), ('Banglore',), ('Delhi',), ('Chennai',)]

<b>##6.select column "address" where city not in delhi</b>

In [24]:
%%sql

select * from customers where address <> 'Delhi'

 * sqlite:///cloud.db
Done.

[(1, 'David Beggam', 'California'),
 (2, 'Rahul Josh', 'Mumbai'),
 (3, 'Joe Kamal', 'Banglore'),
 (5, 'Sarath Kumar', 'Chennai')]

### **Check this to see how to use asc, desc in SQL**

https://www.w3schools.com/sql/sql_ref_asc.asp

https://www.w3schools.com/sql/sql_ref_desc.asp

<b>7. sort the column: name in asc and addrress in desc</b>

In [25]:
%%sql
select * from customers order by name, address desc

 * sqlite:///cloud.db
Done.

[(1, 'David Beggam', 'California'),
 (3, 'Joe Kamal', 'Banglore'),
 (4, 'Micheal John', 'Delhi'),
 (2, 'Rahul Josh', 'Mumbai'),
 (5, 'Sarath Kumar', 'Chennai')]

<b>8.  Add an customer name  called "Mary" ,with address in 'Goa'</b>

In [27]:
%%sql
insert into customers(name,address) values('Mary','Goa')

 * sqlite:///cloud.db
1 rows affected.

[]

### **Check this how to use update keyword in sql**

https://www.w3schools.com/sql/sql_update.asp

<b>9. update address to gujarat where id is 1</b>

In [28]:
%%sql
update customers set address = 'Gujarat' where id=1

 * sqlite:///cloud.db
1 rows affected.

[]

In [29]:
%%sql
select * from customers

 * sqlite:///cloud.db
Done.

[(1, 'David Beggam', 'Gujarat'),
 (2, 'Rahul Josh', 'Mumbai'),
 (3, 'Joe Kamal', 'Banglore'),
 (4, 'Micheal John', 'Delhi'),
 (5, 'Sarath Kumar', 'Chennai'),
 (None, 'Mary', 'Goa')]

### **Check this how you to use delete keyword in sql**

https://www.w3schools.com/sql/sql_delete.asp

<b>10.delete the record where address='mumbai'</b>

In [31]:
%%sql
delete from customers where address = 'Mumbai'

 * sqlite:///cloud.db
1 rows affected.

[]

In [32]:
%%sql
select * from customers

 * sqlite:///cloud.db
Done.

[(1, 'David Beggam', 'Gujarat'),
 (3, 'Joe Kamal', 'Banglore'),
 (4, 'Micheal John', 'Delhi'),
 (5, 'Sarath Kumar', 'Chennai'),
 (None, 'Mary', 'Goa')]

### **Check this to see how you create temporary name for the column**

https://www.w3schools.com/sql/sql_alias.asp#:~:text=SQL%20aliases%20are%20used%20to,created%20with%20the%20AS%20keyword.

<b>11.create a temporary name for the column "name"with 'N' and "address"as 'A'</b>

In [33]:
%%sql 
select name as 'N',address as 'A' from customers

 * sqlite:///cloud.db
Done.

[('David Beggam', 'Gujarat'),
 ('Joe Kamal', 'Banglore'),
 ('Micheal John', 'Delhi'),
 ('Sarath Kumar', 'Chennai'),
 ('Mary', 'Goa')]

### **Check this to see how to concat in sqlite**

https://www.sqlitetutorial.net/sqlite-string-functions/sqlite-concat/

<b>12. concat column's "name" and "address" and name it as customerdb</b>

In [34]:
%%sql

select id, name ||','|| address as customerdb from customers

 * sqlite:///cloud.db
Done.

[(1, 'David Beggam,Gujarat'),
 (3, 'Joe Kamal,Banglore'),
 (4, 'Micheal John,Delhi'),
 (5, 'Sarath Kumar,Chennai'),
 (None, 'Mary,Goa')]

In [35]:
%%sql
update customers set id = 6 where name='Mary'

 * sqlite:///cloud.db
1 rows affected.

[]

In [37]:
%%sql
select * from customers

 * sqlite:///cloud.db
Done.

[(1, 'David Beggam', 'Gujarat'),
 (3, 'Joe Kamal', 'Banglore'),
 (4, 'Micheal John', 'Delhi'),
 (5, 'Sarath Kumar', 'Chennai'),
 (6, 'Mary', 'Goa')]

### **Check this how to use group by**

https://www.w3schools.com/sql/sql_groupby.asp

<b>##13 select address and also count the column "name" and group by address </b>

In [39]:
%%sql
select address,count(name) as name from customers group by address

 * sqlite:///cloud.db
Done.

[('Banglore', 1), ('Chennai', 1), ('Delhi', 1), ('Goa', 1), ('Gujarat', 1)]

<b>Congratulations !! You Have Just Completed your first step towards becoming an SQL Ninja!</b>